const buffTable = document.querySelector(".js-buff-table")

const data = [
  ["弓", "ムジカv2(超必殺)", 2, "80%", "30秒", ""],
  ["弓", "ムジカv2(伝授)", 2, "60%", "30秒", ""],
  ["弓", "ムジカv2", 1, "50%", "15秒", ""],
  ["弓", "ムジカv1", 3, "70%", "30秒", ""],
  ["弓", "シャディア", 3, "65%", "40秒", ""],
  ["戦", "エシャル", 2, "60%", "30秒", "マナがひとつもないとき、一回だけ発動可能"],
  ["魔", "ビエンタv3(超必殺)", 1, "50%", "16秒", ""],
  ["魔", "ビエンタv3(伝授)", 1, "45%", "16秒", ""],
  ["魔", "ビエンタv3", 1, "40%", "16秒", ""],
  ["魔", "ロクサーナ", 1, "50%", "10秒", ""],
  ["僧", "マリナv3(超必殺)", 1, "50%", "10秒", ""],
  ["僧", "マリナv3(伝授)", 1, "45%", "10秒", ""],
  ["僧", "マリナv3", 1, "40%", "10秒", ""],
  ["僧", "メルルダ", 1, "45%", "10秒", "伝授できない"],
  ["騎", "フローリア", 2, "40%", "30秒", ""],
  ["戦", "ツル姫v2(超必殺)", 1, "40%", "20秒", ""],
  ["戦", "ツル姫v2(伝授)", 1, "35%", "20秒", ""],
  ["戦", "ツル姫v2", 1, "30%", "20秒", ""],
  ["弓", "タリビク", 1, "40%", "12秒", ""],
  ["騎", "ユリアナv3(超必殺)", 1, "35%", "25秒", ""],
  ["騎", "ユリアナv3(伝授)", 1, "30%", "25秒", ""],
  ["騎", "ユリアナv3", 1, "25%", "25秒", ""],
  ["弓", "トリッシュ", 1, "35%", "15秒", "加算型"],
  ["弓", "ギーゼラ", 1, "35%", "12秒", ""],
  ["僧", "ウィヴェアv2", 1, "35%", "10秒", ""],
  ["戦", "体操着アリーチェ", 1, "30%", "20秒", ""],
  ["騎", "クーシャン&シーシャン", 1, "30%", "20秒", ""],
  ["僧", "リーアv2", 1, "30%", "20秒", ""],
  ["僧", "リーアv2(超必殺)", 1, "15%", "40秒", "領域"],
  ["僧", "リーアv2(伝授)", 1, "15%", "40秒", "領域"],
  ["僧", "エルルゥ&アルルゥ", 1, "30%", "20秒", ""],
  ["僧", "ザルブリス", 2, "30%", "20秒", ""],
  ["騎", "ベルヴィード", 2, "30%", "20秒", ""],
  ["僧", "ジブリール", 1, "30%", "18秒", ""],
  ["戦", "ムウティティ", 1, "30%", "15秒", "副都結束ATK15% DMG-10%"],
  ["弓", "拷問官アデライド", 1, "30%", "15秒", "被ダメージ増加のデメリット"],
  ["騎", "オルドレード", 1, "30%", "15秒", "被ダメージ増加のデメリット"],
  ["騎", "バグリス", 2, "30%", "12秒", "無敵"],
  ["僧", "クズノハv2", 1, "30%", "10秒", "伝授できない"],
  ["僧", "トレランシア", 1, "30%", "10秒", ""],
  ["戦", "ハサン", 1, "30%", "10秒", ""],
  ["弓", "一日警邏隊ケーテ", 1, "30%", "20秒", "スクラップ三個排出"],
  ["弓", "気高きスイーツマレーナ", 1, "30%", "20秒", "弓使いのみ・加算型"],
  ["魔", "教育実習生カティア", 1, "28%", "20秒", "防御と移動速度も上がる"],
  ["僧", "リリスv2(超必殺)", 1, "20%", "60秒", "領域"],
  ["僧", "リリスv2(伝授)", 1, "15%", "60秒", "領域"],
  ["魔", "森羅万象の大魔導師アルドラ", 1, "20%", "30秒", "伝授できない 加算型 副都結束ATK25% DMG-10% SPD+?"],
  ["戦", "ハクオロ", 1, "20%", "30秒", "加算型"],
  ["魔", "ファルベv2", 1, "20%", "25秒", "加算型"],
  ["魔", "オデッセイア", 1, "20%", "20秒", "2回バリアもついてくる"],
  ["騎", "モルガンv2", 1, "20%", "15秒", ""],
  ["戦", "クリスマスリフレット", 1, "20%", "15秒", ""],
  ["僧", "イフ", 1, "20%", "15秒", "地形が雪山のときだけ使用可能"],
  ["戦", "アシュリナ", 1, "20%", "10秒", ""],
  ["戦", "ガジジナv2", 1, "15%", "30秒", "加算型"]
]

const buildTable = (tableElement, data) => {
  data.forEach((row)=>{
    const tr = document.createElement("tr")
    const head = row.shift()
    let color;
    switch(head){
    case "戦": color = "red"; break;
    case "騎": color = "royalblue"; break;
    case "弓": color = "orange"; break;
    case "魔": color = "violet"; break;
    case "僧": color = "limegreen"; break;
    }
    const color_tag = `<span style="color: ${color};">`

    row.forEach((column, i)=>{
      const td = document.createElement("td")
      if(i == 1){
        td.innerHTML = color_tag + "●".repeat(column) + "</span>"
      }else {
        td.innerText = column
      }
      tr.appendChild(td)
    })
    tableElement.appendChild(tr)
  })
}

buildTable(buffTable, data)

buildTable(document.querySelector(".js-skill-buff-table"), [
  ['魔', 'エレミア', 0, '4.5%', '90秒', '魔法結束ATK10%'],
  ['魔', 'ブルワリー', 0, '5%', '90秒', '副都結束ATK15% / WAVEバフCRT威力20%'],
  ['魔', 'ファルベ', 0, '3%(戦士か僧侶がいれば7%)', '90秒', '旅人結束ATK15%'],
  ['魔', 'トリリカ', 0, '2.5%(戦士か魔法のみ)', '30秒', '魔法結束ATK16.5%'],
  ['騎', 'フローリア', 0, '3%', '20秒', '聖都結束ATK15% / WAVEバフCRT発生+? SPD+?']
])
